Revit 2026 API

# PointCloudOverrideSettings Class

---

The graphic override settings for one PointCloudInstance element or one of its scans.

SystemObject Autodesk.Revit.DB.PointCloudsPointCloudOverrideSettings

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointCloudOverrideSettings : IDisposable
```
```vb
Public Class PointCloudOverrideSettings
	Implements IDisposable
```
```cpp
public ref class PointCloudOverrideSettings : IDisposable
```
```fsharp
type PointCloudOverrideSettings =
    class
        interface IDisposable
    end
```

The PointCloudOverrideSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PointCloudOverrideSettings | Constructs a settings object with default values. |
|  | PointCloudOverrideSettings(PointCloudOverrideSettings) | Constructs a copy of source object. |

|  | Name | Description |
| --- | --- | --- |
|  | ColorMode | The current color mode for the PointCloudInstance element or its scan. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Visible | Visibility flag for point cloud scans. |

|  | Name | Description |
| --- | --- | --- |
|  | Assign | Assigns values of the source settings to this object. |
|  | Dispose | Releases all resources used by the PointCloudOverrideSettings |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetModeOverride | Lookup color settings for the given color mode. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Checks if the contents of two settings are equal. |
|  | SetModeOverride | Sets color settings for the given color mode. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.PointClouds Namespace